colonelpanichacks/C5VRX/legacy/c5vrx2/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c5"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Native XIAO USB remains scheduled and is never part of realtime pacing.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_PHY_ENABLE_CERT_TEST=y
